<a href="https://colab.research.google.com/github/poduguvenu/Python-Concepts/blob/main/01b_LAB_Reading_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Machine Learning Foundation

## Section 1, Part b: Reading Data Lab

In [2]:
# Imports
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

## Lab Exercise: Reading in database files

 - Create a variable, `path`, containing the path to the `baseball.db` contained in `resources/`
 - Create a connection, `con`, that is connected to database at `path`
 - Create a variable, `query`, containing a SQL query which reads in all data from the `allstarfull` table
 - Create a variable, `observations`, by using pandas' [read_sql](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html)

### Optional
 - Create a variable, `tables`, which reads in all data from the table `sqlite_master`
 - Pretend that you were interesting in creating a new baseball hall of fame. Join and analyze the tables to evaluate the top 3 all time best baseball players.

> ## BEGIN SOLUTION

In [8]:
# Create a variable, `path`, containing the path to the `baseball.db` contained in `resources/`
path = 'baseball.db'
path

'baseball.db'

In [9]:
# Create a connection, `con`, that is connected to database at `path`
con = sq3.Connection(path)

In [10]:
# Create a variable, `query`, containing a SQL query which reads in all data from the `` table

query = """
SELECT *
    FROM allstarfull
    ;
"""

In [12]:
# print(allstar_observations)
allstar_observations = pd.read_sql(query, con)

In [14]:
# Create a variable, tables, which reads in all data from the table sqlite_master
all_tables = pd.read_sql('SELECT * FROM sqlite_master', con)
display(all_tables)

    type  ...                                                sql
0  table  ...  CREATE TABLE "allstarfull" (\n"index" INTEGER,...
1  index  ...  CREATE INDEX "ix_allstarfull_index"ON "allstar...
2  table  ...  CREATE TABLE "schools" (\n"index" INTEGER,\n  ...
3  index  ...  CREATE INDEX "ix_schools_index"ON "schools" ("...
4  table  ...  CREATE TABLE "batting" (\n"index" INTEGER,\n  ...
5  index  ...  CREATE INDEX "ix_batting_index"ON "batting" ("...

[6 rows x 5 columns]

In [15]:
# Create a variable, tables, which reads in all data from the table sqlite_master
all_tables = pd.read_sql('SELECT * FROM sqlite_master', con)
print(all_tables)

    type  ...                                                sql
0  table  ...  CREATE TABLE "allstarfull" (\n"index" INTEGER,...
1  index  ...  CREATE INDEX "ix_allstarfull_index"ON "allstar...
2  table  ...  CREATE TABLE "schools" (\n"index" INTEGER,\n  ...
3  index  ...  CREATE INDEX "ix_schools_index"ON "schools" ("...
4  table  ...  CREATE TABLE "batting" (\n"index" INTEGER,\n  ...
5  index  ...  CREATE INDEX "ix_batting_index"ON "batting" ("...

[6 rows x 5 columns]

In [16]:
# Pretend that you were interesting in creating a new baseball hall of fame. Join and analyze the tables to evaluate the top 3 all time best baseball players
best_query = """
SELECT playerID, sum(GP) AS num_games_played, AVG(startingPos) AS avg_starting_position
    FROM allstarfull
    GROUP BY playerID
    ORDER BY num_games_played DESC, avg_starting_position ASC
    LIMIT 3
"""

In [17]:
best = pd.read_sql(best_query, con)
display(best.head())
### END SOLUTION

    playerID  num_games_played  avg_starting_position
0  musiast01              24.0               6.357143
1   mayswi01              24.0               8.000000
2  aaronha01              24.0               8.470588

In [18]:
### BEGIN SOLUTION
# Create a variable, `path`, containing the path to the `baseball.db` contained in `resources/`
path = 'baseball.db'

# Create a connection, `con`, that is connected to database at `path`
con = sq3.Connection(path)

# Create a variable, `query`, containing a SQL query which reads in all data from the `` table

query = """
SELECT *
    FROM allstarfull
    ;
"""

allstar_observations = pd.read_sql(query, con)

# print(allstar_observations)

# Create a variable, tables, which reads in all data from the table sqlite_master
all_tables = pd.read_sql('SELECT * FROM sqlite_master', con)
display(all_tables)

# Pretend that you were interesting in creating a new baseball hall of fame. Join and analyze the tables to evaluate the top 3 all time best baseball players
best_query = """
SELECT playerID, sum(GP) AS num_games_played, AVG(startingPos) AS avg_starting_position
    FROM allstarfull
    GROUP BY playerID
    ORDER BY num_games_played DESC, avg_starting_position ASC
    LIMIT 3
"""
best = pd.read_sql(best_query, con)
display(best.head())
### END SOLUTION

    type  ...                                                sql
0  table  ...  CREATE TABLE "allstarfull" (\n"index" INTEGER,...
1  index  ...  CREATE INDEX "ix_allstarfull_index"ON "allstar...
2  table  ...  CREATE TABLE "schools" (\n"index" INTEGER,\n  ...
3  index  ...  CREATE INDEX "ix_schools_index"ON "schools" ("...
4  table  ...  CREATE TABLE "batting" (\n"index" INTEGER,\n  ...
5  index  ...  CREATE INDEX "ix_batting_index"ON "batting" ("...

[6 rows x 5 columns]

    playerID  num_games_played  avg_starting_position
0  musiast01              24.0               6.357143
1   mayswi01              24.0               8.000000
2  aaronha01              24.0               8.470588